Repository: n8rob/corpora
Catalog: french_haitian/archive/en-ht (1).tmx
Source language: en
Languages: ht

source: And then these little spaces between the myelin sheath-- just so we have all of the terminology from-- so we know the entire anatomy of the neuron-- these are called the nodes of Ranvier.
ht: Et puis sa yo ti mache ant la gaine- sèlman pou nou gen tout de terminologie de -Se konsa nou konnen tout antye ò moun ewonn a- yo rele Ranvier de noeuds.

source: I guess they're named after Ranvier.
ht: Mwen panse yo ap rele dèyè Ranvier.

source: Maybe he was the guy who looked and saw they had these little slots here where you don't have myelin sheath.
ht: Gen dwa li te genyen nèg la ki gade, wè yo te gen sa yo ti kras emplacements isit la ki kote ou pa gen gaine la.

source: So these are the nodes of Ranvier.
ht: Se poutèt sa, se sa Ranvier de noeuds yo.

source: So the general idea, as I mentioned, is that you get a signal here.
ht: Se konsa lide jeneral an, menm jan mwen te mansyone, se pou ou jwenn yon siyal isit la.

source: We're going to talk more about what the signal means-- and then that signal gets-- actually, the signals can be summed, so you might have one little signal right there, another signal right there, and then you'll have maybe a
ht: Nou pwal pale plis toujou sou an siy ki vle di - Et Lè sa a sa signal gen - aktyèlman, siyal kapab résumé Se konsa ou te ka jwenn yonn ti siyal la a, yon lòt siyal la a.

source: larger signal there and there-- and that the combined effects of these signals get summed up and they travel to the hillock and if they're a large enough, they're going to trigger an action potential on the axon, which will cause a signal to travel down the balance of the axon and then over here it might be connected via synapses to other dendrites or muscles.
ht: Apre sa ou ap gen petèt yon pi gwo siyal la Et la- ak efè konbine signaux sa yo jwenn résumé yo vwayaje ale bit tè a ak si yo gen yon gwo ase, yo pwal itilize yon aksyon potentiel sou axon a, ki pwal koze yon siyal pou l vwayaje atè a balans de la axon Et puis isit la sou li peut être konekte Via synapses pou lòt dendrites ou frèt

source: And we'll talk more about synapses and those might help trigger other things.
ht: Nou pwal pale plis toujou sou synapses Et moun te ka ede itilize lòt bagay.

source: So you're saying, what's triggering these things here?
ht: Se konsa, ou di, sa déclenchement bagay sa yo isit la?

source: Well, this could be the terminal end of other neurons' axons, like in the brain.
ht: Men, sa te kapab fin de fè a de axons neurones lòt tankou nan sèvo an.

source: This could be some type of sensory neuron.
ht: Sa te kapab yon kalite ansoryèl ewonn.

source: This could be on a taste bud someplace, so a salt molecule somehow can trigger it or a sugar molecule-- or this might be some type of sensor.
ht: Sa te kapab sou yon goût boujon someplace, se konsa yon sèl Molekil enpòt kijan kapab itilize li, ni yon Molekil sik - ou sa te kapab yon kalite materyèl detèktè tèt chaje.

source: It could be a whole bunch of different things and we'll talk more about the different types of neurons.
ht: Li ta ka yon pakèt tout lòt bagay e nou pwal pale plis toujou sou diferan kalite neurones.

source: In the last video on the lungs or the gas exchange in our bodies or on the pulmonary system, we left off with the alveolar sacs.
ht: Nan videyo dènye a nan poumon ou an echanj gaz nan nou kò ou sou sistèm ti kay la, nou te kite ak a battue sacs.

source: Let me draw one right here.
ht: Kite m' fè yonn isit-menm.

source: So we have these alveolar sacs that I talked about and they're in these little clumps like this.
ht: Se poutèt sa, nou pa gen sacs battue sa yo sa mwen te pale osijè de Et yo gen nan sa yo ti kras rassemble kon sa.

source: Let me draw a couple of them just so you get the idea.
ht: Tanpri trase yon koup yo jis pou ou fè lide a.

source: And if you remember from the last video, these are kind of where air goes in through our trachea, then that splits up into our bronchi, and then those split into the bronchioles, and the bronchioles terminate at these alveoli.
ht: Si ou pa bliye de videyo dènye a, se sa jan de kote ki lè pase nan gòj di nou, puis sa divise nan wonch nou. Lè sa a moun separe nan a bronchioles, Et bronchioles yo revoke nan alveoli sa yo.

source: So that's the alveoli.
ht: Se poutèt sa se alveoli yo.

source: These are these super-small sacs that we talked about in the last video on the pulmonary system.
ht: Se sa yo rele sacs super-small sa yo ke nou te pale osijè de nan dènye videyo sou sistèm ti kay la.

source: You might want to watch that video if none of this sounds familiar.
ht: Ou ta vle pou veye sa videyo si aucun sa sanble abitye.

source: And then of course we have our bronchiole that feeds into this, and then that might have branched off from another one that feeds into another set of alveolar sacs, but I don't want to get too focused on that.
ht: E men wi nou gen nou bronchiole ke rss nan sa lè sa a ki te ka ont avec hors de lòt sa rss antre nan yon lòt ansanm de sacs battue, men, mwen pa vle pou yo te ka twò chita sou sa.

source: I covered that in the last video.
ht: Mwen kouvri sa nan videyo dènye a.

source: In the last video, we saw that air, when we breathe in, when our diaphragm contracts and makes our lungs expand and fill up that space, air comes in.
ht: Nan dènye videyo a, nou te wè lè sa a, lè nou respire nan, lè kapòt pou fanm nou contrats fè nou poumon elaji Et kont li moute pase sa, lè rive.

source: Air comes in and that air that comes in is going to be-- as we're breathing atmospheric air-- it's going to be 21% oxygen and it's going to be 78% nitrogen.
ht: Lè rive Et de sa lè sa rive. Se va pwal - kòm nou ap respire aeryen atmosphère-li pwal 21 % oksijèn Et li pwal Azòt 78%.

source: And actually, in our atmosphere, carbon dioxide is actually almost a trace gas.
ht: E aktyèlman, nan atmosfè nou, kabòn aktyèlman prèske yon tras gaz.

source: It's less than 1%.
ht: Sa se pipiti pase 1%.

source: So any time you breathe in on Earth, this is what you're going to get.
ht: Se konsa, nenpòt ki lè ou respire sou latè, se sa w ap pwal pou jwenn.

source: And we said in the last video that you have these capillaries, these pulmonary capillaries that are running all along the side of these alveoli.
ht: Nou te reponn nan videyo dènye a ke ou gen sa yo kapilè, kapilè san fanmi sa yo ki ap kouri tout ansanm ki bò larivyè alveoli sa yo.

source: So let me draw those pulmonary capillaries-- and so when they are de-oxygenated-- so they come here to be oxygenated.
ht: Se pou m' fè sa san fanmi kapilè - Et pour lè yo sont de-oxygenated-se konsa yo vin isit la pou fè ksijene.

source: So when they're de-oxygenated, they might look a little purplish.
ht: Se konsa lè yo ap de-oxygenated, yo kapab gade yon ti.

source: And then they pick up the oxygen from inside the alveoli-- or the oxygen diffuses across the membrane of the alveoli, into these capillaries, into these super small tubes.
ht: Epi lè sa a yo ranmase oksijèn de anndan an alveoli - ou oksijèn an diffuses Sur la len de alveoli, nan kapilè sa yo, louvwi sa yo nan ti ti tiyo nou.

source: And then once they do, that makes the blood red.
ht: E apre sa yon fwa ke yo te fè, sa fè san wouj.

source: I'm going to talk in a little bit about why it becomes red.
ht: M pral pale nan yon ti sou poukisa l' vin wouj.

source: So then it becomes red, and now that the blood is red, it has its oxygen.
ht: Se konsa lè sa a, l' vin wouj, Et kounye a ke san an wouj, li gen oksijèn li.

source: The whole point is to get the oxygen.
ht: Pwen an antye se pou mwen jwenn oksijèn an.

source: It's ready to go back to the heart.
ht: L' pa vle pou yo tounen al jwenn kè moun.

source: So that's just one little part of it.
ht: Se konsa, sa se yon sèl ti pati li.

source: And we learned in the last video that something that goes away from the heart-- so this is going away from the heart-- that is an artery. "A" for "way". Artery.
ht: E nou te prete nan videyo dènye a ke yon bagay la pou kite kè - se poutèt sa ap kite kè- sa se yon gwo venn, yon chemen kat gwo venn.

source: And something that's going towards the heart is a vein.
ht: Ak yon bagay ki pral rive sou kè se yon venn nan janm.

source: So this right here is a vein.
ht: Se poutèt sa isit-menm se yon venn nan janm.

source: Now one question-- and this actually came up in the last video.
ht: Kounye a yon sèl kesyon - Et sa a aktyèlman est leve kanpe nan videyo dènye a.

source: Someone asked-- which I think is a very good question-- is, gee, when we breathe in, most of the air is nitrogen.
ht: Yon moun te mande ki kote mwen kwè se yon bon kesyon ki se, gee, lè nou respire, pifò nan lè a se Azòt.

source: Only 21% is oxygen.
ht: Sèlman 21% se oksijèn.

source: What happens to all that nitrogen there?
ht: Sa k rive koukouloukou tout sa Azòt la?

source: How come that doesn't go into our blood?
ht: Ki fè ke pa antre nan san nou?

source: And that's actually an excellent question.
ht: E se pou sa aktyèlman yon trè bon kesyon.

source: So to answer that, I think that actually helps explain what's going on here.
ht: Se konsa pou reponn, mwen kwè ke sa te ede aktyèlman eksplike sa k pase isit la.

source: Let's draw a little bit bigger.
ht: An n, trase yon ti jan plus.

source: This is the inside of of an alveolus.
ht: Sa se anndan de yon lveyòl.

source: This is its membrane right here, super thin, almost one cell thick.
ht: Sa se li len droit isit la, super chèch, prèske yon selil byen pwès.

source: And then you have a capillary running right next to it.
ht: E ou gen yon kouri capillaire droit tou pre l.

source: Let me do that in a neutral color.
ht: Se pou m' fè sa nan yon koulè netral.

source: So you have a capillary that's maybe running right along the surface.
ht: Se konsa, ou gen yon ti venn ki gen dwa kouri droit nan sifas la.

source: And this is porous to gases like oxygen, and nitrogen, carbon dioxide.
ht: Men poreux pou gaz yo tankou oksijèn, Et Azòt, kabòn.

source: And what we have here-- let's say that this is-- so the heart is over here.
ht: Ak sa nou genyen isit lan-- Ann di ke sa se - pour la kè se sou isit la.

source: So this is blood coming from the heart and then this is going to go back to the heart.
ht: Se poutèt sa se san ki soti nan kè yo ak lè sa a, sa se pwal pou tounen nan kè moun.

source: Well, the heart's on both sides.
ht: Men, kè yon moun sou tou de kote yo.

source: So let me write it this way.
ht: Se pou m' ekri l' chemen sa a.

source: From the heart and to the heart.
ht: Tout kè Et pou kè moun.

source: And what you have here is-- when we're coming from the heart, this is de-oxygenated blood and it's actually going to have a high concentration of carbon dioxide.
ht: Ak sa ou gen isit la se - lè nou ap soti la kè, sa se san de-oxygenated Et li aktyèlman ap pou gen yon konsantrasyon kabòn anwo nan syèl la.

source: I already did nitrogen as green.
ht: M' te deja fè Azòt kòm vèt.

source: Let me do carbon dioxide as orange.
ht: Se pou m' fè kabòn kòm Orange Village.

source: There's a lot of carbon dioxide and actually carbon dioxide actually gets diffused in the blood.
ht: Se yon bann kabòn Et aktyèlman kabòn dyosid aktyèlman obtient diffused nan san an.

source: It actually is carried in the plasma of the blood.
ht: Li aktyèlman te genyen nan ikid ki nan san nan san.

source: It's not carried by red blood cells that we're going to talk about in a second.
ht: Yo te l' pa pote globil wouj nan san ke nou pral pale osijè de nan yon lòt.

source: So that's a bunch of carbon dioxide here.
ht: Se poutèt sa se yon pakèt moun kabòn isit la.

source: And the concentration of carbon dioxide in the de-oxygenated blood is going to be higher than the concentration of carbon dioxide in the alveolus. so if this is porous to carbon dioxide, this membrane-- and it is, these carbon dioxide molecules are going to diffuse into the alveolus.
ht: Et konsantrasyon kabòn nan de la san de-oxygenated pwal pi wo pase a konsantrasyon kabòn nan lveyòl a. Si sa poreux kabòn, len sa a - Et li se, molécules kabòn sa yo pwal diffuse nan lveyòl a.

source: Now on the other side of that-- we have oxygen here.
ht: Koulye a sou lòt bò larivyè ki - nou gen oksijèn isit la.

source: We're breathing it in.
ht: Nou ap respire li.

source: The air is 21% oxygen so you're actually going to have a lot more oxygen than carbon dioxide.
ht: Lè se 21% oksijèn pou ou aktyèlman pral fè ont oksijèn anpil plis pase kabòn.

source: And this is de-oxygenated blood.
ht: Et sa se san de-oxygenated.

source: We used all of the oxygen in our body and we'll talk more about that either at the end of this video or in a future video on how we use it or where it goes in our body, but there's no oxygen here so the oxygen is going to be taken-- it's going to diffuse across this membrane because the concentration of oxygen is low.
ht: Nou te itilize tout oksijèn a nan kò nou e nou pwal pale plis toujou osijè de sa swa nan fen videyo sa a, ni nan tan kap vini yon vidéo sou jan nou sèvi l' ak ou kote l' pase nan kò nou, men, se pa oksijèn isit la se konsa oksijèn an pwal pran- li pwal diffuse Sur len sa a paske a konsantrasyon oksijèn faible.

source: Now the question is-- so immediately you see that as the oxygen diffuses across this membrane, all of a sudden, this is oxygenated blood ready to go back to the heart.
ht: Koulye a kesyon an se - konsa immédiatement ou wè ki jan oksijèn an diffuses Sur len sa a, tout yon sanzatann, sa se san oxygenated prè pou tounen al jwenn kè moun.

source: So this transition between artery and vein is a very subtle thing.
ht: Se konsa, tranzisyon sa a ant venn kè ak venn nan janm se yon trè subtiles bagay sa.

source: Very clearly here, you say that, OK, this is going from the heart.
ht: Trè klè isit la, nou pa di sa, dakò, sa se soti nan kè moun.

source: This is our vein.
ht: Sa se nan venn nan kou nou.

source: This is going to the heart-- sorry.
ht: Sa ap bay moun kè-m regrèt.

source: I always get confused.
ht: Mwen toujou jwenn Confusion.

source: This is going away from the heart-- and I was looking for an A and I wrote from.
ht: Sa ta pwale kite kè - Et mwen t' ap tann UN yon Et mwen te ekri de.

source: This is away from the heart so this is an artery.
ht: Sa se kite kè moun sa a se yon gwo venn poutèt.

source: And this is going to the heart so this is a vein.
ht: E sa pwal kè se poutèt sa yon venn nan janm.

source: So you could make the division.
ht: Se konsa ou te kapab fè divizyon an.

source: You could say, OK, once it's oxygenated, maybe we're going back to the heart, but it's kind of an arbitrary-- sorry.
ht: Nou te kapab di: dakò, yon fwa ke li ksijene, petèt nou pwal tounen kè, men, se pa ti jan yon abitrè ­ padon.

source: I spelled artery wrong.
ht: Mwen orthographe venn kè ki mal.

source: These are my flaws.
ht: Se sa défauts m' yo.

source: Spelling was never my strong suit.
ht: Ètograf te janm pwosè gen tout pouvwa m' genyen.

source: So it's hard to say where the artery ends and the vein begins.
ht: Se konsa, li pa klè pou di kote gwo venn a fini Et venn nan janm a kòmanse.

source: A good demarcation is when the carbon dioxide concentration goes low and that the oxygen concentration goes high.
ht: Yon bon délimitation se lè a konsantrasyon kabòn se faible Et a konsantrasyon oksijèn se anwo nan syèl la.

source: That's a good time, where we start from the pulmonary artery.
ht: Sa se yon bon tan, kote nou kòmanse de pulmonaire venn kè.

source: Probably in the next video, I will a make a very-- you'll see why the pulmonary arteries are special, because pulmonary arteries coming away from the heart have no oxygen or very little oxygen and they have a lot of carbon dioxide.
ht: Pwobableman nan videyo kap vini a, mwen p'ap fè yon yon très - ou ap wè Poukisa artères pulmonaire yo sont espesyal, paske san fanmi artères t' ap kite kè ont oksijèn pa ou anpil ti oksijèn Et yo gen anpil kabòn.

source: So pulmonary veins, which is-- it's arbitrary where the artery turns into a vein.
ht: Se konsa pulmonaire varis, ki se - se abitrè kote a gwo venn active nan yon venn nan janm.

source: Once it gets oxygenated, it's ready to go back to the heart.
ht: Yon fwa ke li jwenn ksijene, l' pa vle pou yo tounen al jwenn kè moun.

source: It's a pulmonary vein and it is oxygenated.
ht: Li se yon venn nan kou pulmonaire Et ksijene.

source: So it has oxygenated-- and we could write de-oxygenated.
ht: Se konsa, li te ksijene - nou te kapab ekri ak de-oxygenated.

source: Now the reason why I say it's special besides the fact that pulmonary arteries and veins go to and from the lungs, is that they're kind of the opposite.
ht: Koulye a, Poukisa mwen di l' konsa espesyal apa a fait sa pulmonaire artères Et varis al nan poumon, se sa yo ke ti jan opoze a.

source: Because in the rest of the body when we're going away from the heart or we're talking about arteries, you're going to see that that's oxygenated blood, while when we're going away from the heart to the lungs, that's de-oxygenated blood.
ht: Paske nan tout rès kò a, lè nou pral ale tout kè ou nap pale de artères, w ap ale wè sa ki te ksijene san, pandan ke lè nou pral kite kè poumon yo, sa se afè san de-oxygenated.

source: Similarly in the rest of the body, when we're going to the heart, where you're to see that that's de-oxygenated blood, but in the pulmonary vein, when we're going to the heart, it's oxygenated because the lungs are what take up the carbon dioxide and give us the oxygen.
ht: Nan tout rès kò a, lè nou pral, de la kè yo: ki kote ou gen pou wè ke sa de-oxygenated san, men nan venn a pulmonaire nan, lè nou pral la kè, li te ksijene paske poumon yo ki pote a kabòn Et oksijèn an, ban nou.

source: Now I still haven't answered that interesting question that rose on the message board on the last video.
ht: Koulye a, mwen toujou pa reponn kesyon enteresan sa sa Rose sou tablo mesaj an nan videyo dènye a.

source: What happens to the 78% of nitrogen that's sitting here?
ht: Sa k rive koukouloukou 78% Azòt ki chita la a?

source: There's just a ton of nitrogen over here, more than the oxygen, a lot more than the carbon dioxide.
ht: Se jis yon paj Azòt sou isit la, plis pase a oksijèn, anpil plis pase a kabòn.

source: What happens to all of these nitrogen molecules?
ht: Sa k rive koukouloukou a tout molécules Azòt sa yo?

source: And the answer is, nitrogen can diffuse and does diffuse into the blood, but the blood's ability to take in nitrogen isn't that high.
ht: Et reponn a se, Azòt kapab diffuse Et diffuse nan san an, men, abilite san an pou li resevwa Azòt se pat sa wo.

source: And you might say, well, why is oxygen special?
ht: Apre sa, nou pa ka di, men, Poukisa se oksijèn espesyal?

source: Why can the blood take up oxygen so much easier than nitrogen?
ht: Poukisa Mèt la san fè moute oksijèn se konsa pi fasil pase Azòt?

source: And that's where the red blood cells come into play.
ht: E se pou sa ki kote selil wouj yo rive nan jwèt.

source: I'll write it in red.
ht: M' ap ekri l' nan wouj.

source: Red blood cells, which are fascinating on a whole set of levels.
ht: Globil wouj nan san, ki fascinante sou yon tout ansanm ki nivo.

source: What red blood cells-- these are these cells that are sitting in-- they're flowing through our circulatory system and they look kind of like lozenges, if I were to draw one.
ht: Ki selil wouj - sa sont cellules sa yo ki chita nan - yo ap koule nan nou san/sikilatwa Et yo sanble ti jan de rhombes, si mwen te gen pou fè yon sèl.

source: They're kind of like a flattened sphere with a little divot on either side of it-- a lot like a lozenge.
ht: Yo ap tankou yon esfè aplatie ak yon ti kras, ti jan de divot sou ni kote li-anpil tankou yon pasti.

source: So if I were to draw it from the side, it might look something like-- well, from the side, it would look like that and if you could see through it, there'd be a little divot on each side.
ht: Se konsa si m te trase li sòti de kote an, li te ka gade yon bagay tankou - byen, sòti de kote an, li ta ka sanble tankou sa Et si ou te kapab wè pase ladan l, pa ta gen yon ti divot sou chak bò.

source: If I were to draw it at an angle, it would look something like this.
ht: Si m te fè l' nan yon ang, li ta ka sanble yon bagay tankou sa a.

source: There'd be a little divot on that side and there'd be a similar divot on the other side.
ht: Ke ta gen yon ti divot sou ki bò kote yo ki gen pwal yon menm jan an divot sou lòt bò.

source: And red blood cells-- and I could do a whole set of videos just on red blood cells-- they contain hemoglobin.
ht: Globil wouj nan san - Et mwen te kapab fè yon ansanm tout de vidéos globil wouj sèlman sou nan san - yo genyen moglobin.

source: Maybe we'll do a whole video on hemoglobin.
ht: Petèt nou pwal fè yon tout videyo sou moglobin.

source: The hemoglobin are these small proteins that contain four hem groups.
ht: Moglobin a sont protéines ti sa yo ki genyen kat gwoup yo fè woulèt.

source: So inside of red blood cells, you have millions of hemoglobin proteins.
ht: Se konsa, ou gen dè milyon de andedan globil wouj nan san, moglobin protéines.

source: And the hemoglobin proteins-- I'll just draw them as this-- they have these four heme groups.
ht: Et la moglobin protéines - m ap jis trase yo tankou sa - a yo gen kat gwoup heme sa yo.

source: And heme groups, the main component is iron.
ht: Epi heme gwoup, composant pwensipal lan se fèt an fè.

source: And that's why iron is so important.
ht: Se poutèt sa yo ak fèt an fè enpòtan.

source: If you don't have enough iron, you're going to have trouble processing oxygen in your blood and your hemoglobin won't be functional enough.
ht: Si ou pa gen ase fèt an fè, ou pwal gen pwoblèm traitement oksijèn nan san ou Et moglobin ou pas être fonctionnelle ase.

source: But it has iron on it.
ht: Men, li pa gen fèt an fè sou li.

source: It has four of these heme groups.
ht: Li te gen kat gwoup heme sa yo.

source: And each of these heme groups can bond to oxygen molecules.
ht: Et chak nan gwoup heme sa yo kapab bond oksijèn molécules.

source: They're very good binders of oxygen.
ht: Yo gen bon anpil liants de oksijèn.

source: And we're going to see in a little bit-- probably the next video-- how they release the oxygen, but this has tons, this has millions of heme groups in it and the oxygen diffuses across the membrane of the red blood cells and bonds to to the heme groups on your hemoglobin.
ht: E nou pral wè nan yon ti bout - pwobableman sa kap vini an vidéo - comment yo lage oksijèn an, men, sa ki tòn, sa gen dè milyon de gwoup heme nan li a ak oksijèn an diffuses Sur la len de selil wouj Et obligations pou pou gwoup heme yo sou moglobin ou.

source: So because the red blood cells have the hemoglobin inside of them, they're like these sponges for oxygen because hemoglobin is so good at taking in oxygen.
ht: Se poutèt sa, selil wouj yo gen moglobin anndan de yo, y' ap tankou sa yo éponges pou oksijèn paske moglobin bon nan en nan oksijèn an.

source: So the red blood cells are able to essentially suck up all of the oxygen out of the plasma.
ht: Se konsa selil wouj yo ka esansyèlman bwè tout oksijèn soti nan a ikid ki nan san.

source: The plasma we can view as just the general fluid of the blood, not including the red blood cells.
ht: A ikid ki nan san nou kapab wè ke sèlman a jeneral likid de la san, pa, selil wouj yo.

source: So the red blood cell here isn't so red.
ht: Se konsa a wouj san selil ici pa se konsa wouj.

source: And the reason-- and this is the key point-- the reason why it's not so red-- maybe we had a red blood cell over here-- let me make it clear.
ht: Et pourquoi - Et sa se kle pwen - rezon Poukisa se pa konsa wouj ki petèt nou te gen yon selil san wouj sou isit la- kite m' fè wè.
